/*描述
输入一个正整数 n（1 ≤ n ≤ 1000）。
输出下面交错级数的前 n 项之和 S：
a1：1 / (1·1)
a2：- [1 / (1·2) + 1 / (2·2)]
a3：+ [1 / (1·3) + 1 / (2·3) + 1 / (3·3)]
……
an：±[1/(1·n) + 1/(2·n) + … + 1/(n·n)]
符号正负交替，首项为正

S = a1 + a2 + a3 + …… + an

输入
一行，一个正整数 n。

输出
输出结果 S，保留 4 位小数（四舍五入）。

样例
输入

1
输出

1.0000
输入

3
输出

0.8611
*/
#include <stdio.h>
int main() {
    int n;
    double S = 0.0000;
    scanf("%d", &n);
    
    for (int i = 1; i <= n; i++) {
        double a = 0.0000;

        for (int j = 1; j <=i; j++) {
            a += 1.0000 / (j * i);
        }

        if (i % 2 == 1) {
            S += a;
        } else {
            S -= a;
        }
 
    }
    printf ("%.4f\n", S);
    return 0;
}