/*
描述
输入一行 6 个整数：x1 y1 r1 x2 y2 r2
表示圆 C1(x1,y1,r1) 与圆 C2(x2,y2,r2)，半径均>0。
按圆心距d与半径关系输出一个整数表示两个圆的位置关系：
0 相离 1 外切 2 相交 3 内切 4 内含 5 同心

输入
一行 6 个 int，空格分隔。

输出
0–5 之间的整数。

样例
输入

0 0 5 8 0 3
输出

1
输入

0 0 5 8 0 4
输出

2
*/
#include <stdio.h>
int main()
{
    int x1, y1, r1, x2, y2, r2;
    scanf("%d %d %d %d %d %d", &x1, &y1, &r1, &x2, &y2, &r2);

    if (((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2)) > ((r1+r2)*(r1+r2)))
    {
        printf("0\n");
    }

    else if (((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2)) == ((r1+r2)*(r1+r2)))
    {
        printf("1\n");
    }

    else if (((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2)) < ((r1+r2)*(r1+r2)) && (((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2)))>((r1-r2)*(r1-r2)))
    {
        printf("2\n");
    }

    else if (((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2)) == ((r1-r2)*(r1-r2)))
    {
        printf("3\n");
    }

    else if (((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2)) < ((r1-r2)*(r1-r2)) && ((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2)) !=0)
    {
        printf("4\n");
    }
    
    else
    {
        printf("5\n");
    }
    
    return 0;
}